mittelab/keycard-access/tests/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=40960
CONFIG_MBEDTLS_DES_C=y
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=6144
CONFIG_PN532_HSU_TX=11
CONFIG_PN532_HSU_RX=12
CONFIG_PN532_CHANNEL_SELECTION=y
CONFIG_PN532_I0=5
CONFIG_PN532_I1=6
CONFIG_PN532_RSTN=18
